//리덕스와 컨텍스트 중 무엇을 사용해야할까? 
//서버에서 가져온 데이터를 이용하여 새로운 결과물을 만드는 경우에는 리덕스를, 
//컴포넌트의 통합 데이터를 관리하는 경우에는 컨텍스트를 사용하는 것을 추천한다. 

//컨텍스트 : 부모 컴포넌트에서 생성하여 모든 자식 컴포넌트에게 전달하는 데이터
//리덕스 : 서버에서 받은 데이터를 앱 전체에 전달하거나 관리합니다. 

//리덕스의 동작 원리 : 
//컴포넌트는 dispatch()함수를 통해 리듀서에 액션을 전달한다. 액션에는 리듀서에서 처리해야 할 작업의 이름과 데이터가 객체 형태로 들어있다. 
//리듀서는 액션을 받아 스토어 변경 작업을 진행한다. 스토어 변경 작업이 완려되면 connect()함수로 연결된 컴포넌트에 변경된 스토어의 데이터를 전파하여 동기화한다. 

//위 과정을 음식점에서 손님이 음식을 주문하는 과정에 비유하면 컴포넌트는 손님, dispatch(),connect()는 종업원, 액션은 주문서, 리듀서는 요리사 라고 생각하면 됩니다. 손님이 (컴포넌트)이 종업원(디스패치)에게 음식을 주문하면 주문서(액션)은 요리사(리듀서)에게 전달합니다. 요리사가 음식을 완성하면 종업원(콘넥트)이 손님에게 음식을 전달하지요. 